# 6.1 Bank Failures and Assistance Data

#### Table of Contents

### 1. Importing Libraries & Data

### 2. DataFrame Information

### 3. Data Wrangling & Cleaning

### 4. Descriptive Statistics

### 5. Exporting Data

## 1. Importing Libraries & Data

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
#Pathway to the Dataframes
path = r'C:\Users\Dallas\Desktop\Data Analyst - Projects\Data Immersion\Data Immersion A6\FDIC Bank Failure prediction'

In [3]:
df = pd.read_csv(os.path.join(path, 'Datasets', 'Original Data', 'DS8_BankSuite_Failures_1934-2023_DateFormat.csv'), index_col = False)

## 2. DataFrame Information

In [4]:
#First five rows
df.head

<bound method NDFrame.head of          CERT CHCLASS1               CITY STATE        COST    FAILDATE  \
0     59017.0       NM      SAN FRANCISCO    CA         NaN  2023-05-01
1     57053.0       NM           NEW YORK    NY   2400000.0  2023-03-12
2     24735.0       SM        SANTA CLARA    CA  16100000.0  2023-03-07
3     15426.0       NM             ALMENA    KS     16330.0  2020-10-23
4     16748.0       NM  FORT WALTON BEACH    FL      7247.0  2020-10-16
...       ...      ...                ...   ...         ...         ...
4102      NaN       NM          LEWISPORT    KY         NaN  1934-08-06
4103      NaN        N               LIMA    MT         NaN  1934-07-18
4104      NaN       NM           FLORENCE    IN         NaN  1934-07-18
4105      NaN       NM        EAST PEORIA    IL         NaN  1934-05-28
4106      NaN       NM         PITTSBURGH    PA         NaN  1934-04-19

        FIN    ID                         NAME     QBFASSET       QBFDEP  \
0     10543  4107          FIRST REPUBLIC BANK  212638872.0  176436706.0
1     10540  4106               SIGNATURE BANK  110363650.0   88612911.0
2     10539  4105          SILICON VALLEY BANK  209026000.0  175378000.0
3     10538  4104            ALMENA STATE BANK      65733.0      64941.0
4     10537  4103   FIRST CITY BANK OF FLORIDA     136566.0     133936.0
...     ...   ...                          ...          ...          ...
4102      0    65            BANK OF LEWISPORT         81.0         68.0
4103      0    63  FIRST NATIONAL BANK OF LIMA         91.0         42.0
4104      0    64        FLORENCE DEPOSIT BANK        105.0         69.0
4105      0    61        FON DU LAC STATE BANK        374.0        238.0
4106      0    62    BANK OF AMERICA TRUST CO.       1435.0       1064.0

      RESTYPE RESTYPE1 SAVR
0     FAILURE       PA  DIF
1     FAILURE       PA  DIF
2     FAILURE       PA  DIF
3     FAILURE       PA  DIF
4     FAILURE       PA  DIF
...       ...      ...  ...
4102  FAILURE       PO  BIF
4103  FAILURE       PO  BIF
4104  FAILURE       PO  BIF
4105  FAILURE       PO  BIF
4106  FAILURE       PO  BIF

[4107 rows x 14 columns]>

In [5]:
#Number of rows and columns
df.shape

(4107, 14)

In [6]:
#Basic information of the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4107 entries, 0 to 4106
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CERT      3619 non-null   float64
 1   CHCLASS1  4107 non-null   object
 2   CITY      4107 non-null   object
 3   STATE     4107 non-null   object
 4   COST      3468 non-null   float64
 5   FAILDATE  4107 non-null   object
 6   FIN       4107 non-null   int64
 7   ID        4107 non-null   int64
 8   NAME      4107 non-null   object
 9   QBFASSET  3953 non-null   float64
 10  QBFDEP    4105 non-null   float64
 11  RESTYPE   4107 non-null   object
 12  RESTYPE1  4107 non-null   object
 13  SAVR      4107 non-null   object
dtypes: float64(4), int64(2), object(8)
memory usage: 449.3+ KB

In [7]:
#Names of the columns in the dataset
df.columns

Index(['CERT', 'CHCLASS1', 'CITY', 'STATE', 'COST', 'FAILDATE', 'FIN', 'ID',
       'NAME', 'QBFASSET', 'QBFDEP', 'RESTYPE', 'RESTYPE1', 'SAVR'],
      dtype='object')

## 3. Data Wrangling & Cleaning

##### Data Wrangling

In [8]:
#Create new dataFrame
df_wrangled = df

In [9]:
#Information of new DataFrame
df_wrangled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4107 entries, 0 to 4106
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CERT      3619 non-null   float64
 1   CHCLASS1  4107 non-null   object
 2   CITY      4107 non-null   object
 3   STATE     4107 non-null   object
 4   COST      3468 non-null   float64
 5   FAILDATE  4107 non-null   object
 6   FIN       4107 non-null   int64
 7   ID        4107 non-null   int64
 8   NAME      4107 non-null   object
 9   QBFASSET  3953 non-null   float64
 10  QBFDEP    4105 non-null   float64
 11  RESTYPE   4107 non-null   object
 12  RESTYPE1  4107 non-null   object
 13  SAVR      4107 non-null   object
dtypes: float64(4), int64(2), object(8)
memory usage: 449.3+ KB

In [10]:
#Renaming Column Names
df_wrangled.rename(columns = {'CERT' : 'Certification'}, inplace = True)
df_wrangled.rename(columns = {'CHCLASS1' : 'Charter Class'}, inplace = True)
df_wrangled.rename(columns = {'CITY' : 'City'}, inplace = True)
df_wrangled.rename(columns = {'STATE' : 'State'}, inplace = True)
df_wrangled.rename(columns = {'COST' : 'Estimated Loss'}, inplace = True)
df_wrangled.rename(columns = {'FAILDATE' : 'Failure Date'}, inplace = True)
df_wrangled.rename(columns = {'NAME' : 'Bank Name'}, inplace = True)
df_wrangled.rename(columns = {'QBFASSET' : 'Total Assets'}, inplace = True)
df_wrangled.rename(columns = {'QBFDEP' : 'Total Deposits'}, inplace = True)
df_wrangled.rename(columns = {'RESTYPE' : 'Resolution'}, inplace = True)
df_wrangled.rename(columns = {'RESTYPE1' : 'Transaction Type'}, inplace = True)
df_wrangled.rename(columns = {'SAVR' : 'Insurance Fund'}, inplace = True)

In [11]:
#Check to ensure new names corrected
df_wrangled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4107 entries, 0 to 4106
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Certification     3619 non-null   float64
 1   Charter Class     4107 non-null   object
 2   City              4107 non-null   object
 3   State             4107 non-null   object
 4   Estimated Loss    3468 non-null   float64
 5   Failure Date      4107 non-null   object
 6   FIN               4107 non-null   int64
 7   ID                4107 non-null   int64
 8   Bank Name         4107 non-null   object
 9   Total Assets      3953 non-null   float64
 10  Total Deposits    4105 non-null   float64
 11  Resolution        4107 non-null   object
 12  Transaction Type  4107 non-null   object
 13  Insurance Fund    4107 non-null   object
dtypes: float64(4), int64(2), object(8)
memory usage: 449.3+ KB

In [12]:
#Changing datatypes
df_wrangled['Certification'] = df_wrangled['Certification'].astype('str')
df_wrangled['FIN'] = df_wrangled['FIN'].astype('str')
df_wrangled['ID'] = df_wrangled['ID'].astype('str')

In [13]:
#Checking Datatypes
df_wrangled.dtypes

Certification        object
Charter Class        object
City                 object
State                object
Estimated Loss      float64
Failure Date         object
FIN                  object
ID                   object
Bank Name            object
Total Assets        float64
Total Deposits      float64
Resolution           object
Transaction Type     object
Insurance Fund       object
dtype: object

In [14]:
df_wrangled.head()

,Certification,Charter Class,City,State,Estimated Loss,Failure Date,FIN,ID,Bank Name,Total Assets,Total Deposits,Resolution,Transaction Type,Insurance Fund
0,59017.0,NM,SAN FRANCISCO,CA,NaN,2023-05-01,10543,4107,FIRST REPUBLIC BANK,212638872.0,176436706.0,FAILURE,PA,DIF
1,57053.0,NM,NEW YORK,NY,2400000.0,2023-03-12,10540,4106,SIGNATURE BANK,110363650.0,88612911.0,FAILURE,PA,DIF
2,24735.0,SM,SANTA CLARA,CA,16100000.0,2023-03-07,10539,4105,SILICON VALLEY BANK,209026000.0,175378000.0,FAILURE,PA,DIF
3,15426.0,NM,ALMENA,KS,16330.0,2020-10-23,10538,4104,ALMENA STATE BANK,65733.0,64941.0,FAILURE,PA,DIF
4,16748.0,NM,FORT WALTON BEACH,FL,7247.0,2020-10-16,10537,4103,FIRST CITY BANK OF FLORIDA,136566.0,133936.0,FAILURE,PA,DIF

##### Data Cleaning

In [15]:
#Finding Duplicate Values
df_dups = df_wrangled[df_wrangled.duplicated()]

In [16]:
#No Duplicates Found
df_dups

Empty DataFrame
Columns: [Certification, Charter Class, City, State, Estimated Loss, Failure Date, FIN, ID, Bank Name, Total Assets, Total Deposits, Resolution, Transaction Type, Insurance Fund]
Index: []

### Dataframe with missing values being left

In [17]:
#Finding Missing Values
df_wrangled.isnull().sum()

Certification         0
Charter Class         0
City                  0
State                 0
Estimated Loss      639
Failure Date          0
FIN                   0
ID                    0
Bank Name             0
Total Assets        154
Total Deposits        2
Resolution            0
Transaction Type      0
Insurance Fund        0
dtype: int64

### Subsets of Dataframe for missing values: Estimated Loss, Total Assets, Total Deposits

In [18]:
#Subset the missing values from Estimated Loss Column
df_nan_loss = df_wrangled[df_wrangled['Estimated Loss'].isnull() == True]

In [19]:
df_nan_loss

,Certification,Charter Class,City,State,Estimated Loss,Failure Date,FIN,ID,Bank Name,Total Assets,Total Deposits,Resolution,Transaction Type,Insurance Fund
0,59017.0,NM,SAN FRANCISCO,CA,NaN,2023-05-01,10543,4107,FIRST REPUBLIC BANK,2.126389e+08,176436706.0,FAILURE,PA,DIF
512,3510.0,N,CHARLOTTE,NC,NaN,2009-01-16,0,3586,BANK OF AMERICA N.A.,1.471631e+09,954677580.0,FAILURE,OBAM,DIF
514,25178.0,N,SAN FRANCISCO,CA,NaN,2009-01-16,0,3588,BANK OF AMERICA CALIFORNIA N.A.,2.150222e+07,500.0,FAILURE,OBAM,DIF
515,27374.0,NM,SALT LAKE CITY,UT,NaN,2009-01-16,0,3589,MERRILL LYNCH BANK USA,6.180950e+07,53620324.0,FAILURE,OBAM,DIF
516,33143.0,SB,ALEXANDRIA,VA,NaN,2009-01-16,0,3590,COUNTRYWIDE BANK FSB,1.179790e+08,43663251.0,FAILURE,OBAM,DIF
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4102,nan,NM,LEWISPORT,KY,NaN,1934-08-06,0,65,BANK OF LEWISPORT,8.100000e+01,68.0,FAILURE,PO,BIF
4103,nan,N,LIMA,MT,NaN,1934-07-18,0,63,FIRST NATIONAL BANK OF LIMA,9.100000e+01,42.0,FAILURE,PO,BIF
4104,nan,NM,FLORENCE,IN,NaN,1934-07-18,0,64,FLORENCE DEPOSIT BANK,1.050000e+02,69.0,FAILURE,PO,BIF
4105,nan,NM,EAST PEORIA,IL,NaN,1934-05-28,0,61,FON DU LAC STATE BANK,3.740000e+02,238.0,FAILURE,PO,BIF
4106,nan,NM,PITTSBURGH,PA,NaN,1934-04-19,0,62,BANK OF AMERICA TRUST CO.,1.435000e+03,1064.0,FAILURE,PO,BIF

In [20]:
#Subset the missing values from Total Assets Column
df_nan_assets = df_wrangled[df_wrangled['Total Assets'].isnull() == True]

In [21]:
df_nan_assets

,Certification,Charter Class,City,State,Estimated Loss,Failure Date,FIN,ID,Bank Name,Total Assets,Total Deposits,Resolution,Transaction Type,Insurance Fund
3493,30387.0,SL,SANTURCE,PR,NaN,1981-11-20,0,613,FIRST FS&LA OF PUERTO RICO,NaN,NaN,ASSISTANCE,A/A,FSLIC
3580,nan,NM,WILMINGTON,DE,NaN,1976-03-15,11653,523,FARMERS BANK OF THE STATE OF DELAWARE,NaN,370000.0,ASSISTANCE,A/A,BIF
3612,nan,NM,BOSTON (ROXBURY),MA,NaN,1971-07-27,0,491,UNITY BANK & TRUST COMPANY,NaN,9300.0,ASSISTANCE,A/A,BIF
3661,nan,N,EXETER,PA,NaN,1962-02-19,0,446,THE FIRST NATIONAL BANK OF EXETER,NaN,3011.0,FAILURE,P&A,BIF
3717,nan,NM,MT. CARMEL,PA,NaN,1942-11-28,0,390,GUARANTEE TR & SAFE DEP. CO.-MT.CARMEL,NaN,1123.0,FAILURE,P&A,BIF
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4066,nan,SM,ANN ARBOR,MI,NaN,1936-02-15,0,27,FARMERS & MECHANICS BANK,NaN,3734.0,FAILURE,P&A,BIF
4067,nan,NM,ANN ARBOR,MI,NaN,1936-02-15,0,28,THE ANN ARBOR SAVINGS BANK,NaN,6758.0,FAILURE,P&A,BIF
4068,nan,N,ANN ARBOR,MI,NaN,1936-02-15,0,29,THE FIRST NATIONAL BANK & TRUST CO.,NaN,1729.0,FAILURE,P&A,BIF
4070,nan,N,CLINTON,OK,NaN,1936-02-01,0,25,THE FIRST NATIONAL BANK OF CLINTON,NaN,437.0,FAILURE,P&A,BIF
4080,nan,NM,BETHLEHEM,PA,NaN,1935-11-16,0,15,E. P. WILBUR TRUST COMPANY,NaN,4357.0,FAILURE,P&A,BIF

In [22]:
#Subset the missing values from Total Deposits Column
df_nan_deposits = df_wrangled[df_wrangled['Total Deposits'].isnull() == True]

In [23]:
df_nan_deposits

,Certification,Charter Class,City,State,Estimated Loss,Failure Date,FIN,ID,Bank Name,Total Assets,Total Deposits,Resolution,Transaction Type,Insurance Fund
3493,30387.0,SL,SANTURCE,PR,NaN,1981-11-20,0,613,FIRST FS&LA OF PUERTO RICO,NaN,NaN,ASSISTANCE,A/A,FSLIC
3609,nan,SM,DETROIT,MI,NaN,1972-01-18,12894,498,BANK OF THE COMMONWEALTH,1300000.0,NaN,ASSISTANCE,A/A,BIF

### Dataframe with all missing rows removed: Total of 639 rows

In [24]:
#Remove all rows where the estimated loss is missing
df_wrangled_clean = df_wrangled[df_wrangled['Estimated Loss'].isnull() == False]

In [25]:
#Check for missing rows
df_wrangled_clean.isnull().sum()

Certification       0
Charter Class       0
City                0
State               0
Estimated Loss      0
Failure Date        0
FIN                 0
ID                  0
Bank Name           0
Total Assets        0
Total Deposits      0
Resolution          0
Transaction Type    0
Insurance Fund      0
dtype: int64

In [26]:
df_wrangled_clean.shape

(3468, 14)

#### NOTE: Only the 'Estimated Loss' column was removed which removed all missing values.  This means that the missing values in the 'Total Assets' and 'Total Deposits' columns were subsets of the 'Estimated Loss' column.  In other words, any column that was missing Total Assets or Total Deposits was also missing Estimated Losses

In [27]:
#Size of new df_wrangled_clean dataframe; 639 rows removed or 15.56% of the df
df_wrangled_clean.shape

(3468, 14)

In [28]:
#Size of original dataframe
df_wrangled.shape

(4107, 14)

### Dataframe with 'Estimated Loss' Column removed

In [29]:
#Remove 'Estimated Loss' column
df_wrangled_drop = df.drop(columns = ['Estimated Loss'])

In [30]:
#Shape of df after removing the 'Estimated Loss' column
df_wrangled_drop.isnull().sum()

Certification         0
Charter Class         0
City                  0
State                 0
Failure Date          0
FIN                   0
ID                    0
Bank Name             0
Total Assets        154
Total Deposits        2
Resolution            0
Transaction Type      0
Insurance Fund        0
dtype: int64

In [31]:
#Remove all rows where the 'Total Assets' is missing
df_wrangled_drop_remove = df_wrangled_drop[df_wrangled_drop['Total Assets'].isnull() == False]

In [32]:
#Missing rows in df with 'Estimated Loss' column removed and empty rows within 'Total Assets' removed
df_wrangled_drop_remove.isnull().sum()

Certification       0
Charter Class       0
City                0
State               0
Failure Date        0
FIN                 0
ID                  0
Bank Name           0
Total Assets        0
Total Deposits      1
Resolution          0
Transaction Type    0
Insurance Fund      0
dtype: int64

In [33]:
#Subset the missing values from Total Deposits Column
df_nan_deposits_2 = df_wrangled_drop_remove[df_wrangled_drop_remove['Total Deposits'].isnull() == True]

In [34]:
df_nan_deposits_2

,Certification,Charter Class,City,State,Failure Date,FIN,ID,Bank Name,Total Assets,Total Deposits,Resolution,Transaction Type,Insurance Fund
3609,nan,SM,DETROIT,MI,1972-01-18,12894,498,BANK OF THE COMMONWEALTH,1300000.0,NaN,ASSISTANCE,A/A,BIF

In [35]:
#Remove row in Total Deposits column 
df_clean = df_wrangled_drop_remove[df_wrangled_drop_remove['Total Deposits'].isnull() == False]

In [36]:
df_clean.isnull().sum()

Certification       0
Charter Class       0
City                0
State               0
Failure Date        0
FIN                 0
ID                  0
Bank Name           0
Total Assets        0
Total Deposits      0
Resolution          0
Transaction Type    0
Insurance Fund      0
dtype: int64

In [37]:
#Shape of df with Estimated Los removed and empty rows removed
df_clean.shape

(3952, 13)

## 4. Descriptive Statistics

### Descriptive Statistics for all three Dataframes: Original df, df with 639 rows removed and df with Estimated Loss column removed

In [38]:
#Descriptive Statistics of original dataframe
df_wrangled.describe()

       Estimated Loss  Total Assets  Total Deposits
count    3.468000e+03  3.953000e+03    4.105000e+03
mean     7.998170e+04  1.366788e+06    7.527356e+05
std      4.243630e+05  3.130100e+07    1.621481e+07
min     -1.138100e+04  1.400000e+01    0.000000e+00
25%      3.161000e+03  1.791900e+04    1.462800e+04
50%      1.130400e+04  5.544800e+04    4.950400e+04
75%      4.289825e+04  1.974420e+05    1.750100e+05
max      1.610000e+07  1.471631e+09    9.546776e+08

In [39]:
#Descriptive statistics of dataframe with removed rows
df_wrangled_clean.describe()

       Estimated Loss  Total Assets  Total Deposits
count    3.468000e+03  3.468000e+03    3.468000e+03
mean     7.998170e+04  5.599016e+05    4.392969e+05
std      4.243630e+05  6.740647e+06    4.733224e+06
min     -1.138100e+04  1.731000e+03    0.000000e+00
25%      3.161000e+03  2.487300e+04    2.445750e+04
50%      1.130400e+04  6.876950e+04    6.734650e+04
75%      4.289825e+04  2.203200e+05    2.053102e+05
max      1.610000e+07  3.070216e+08    1.882608e+08

In [40]:
#Descriptive statistics of dataframe with Estimated Loss column removed
df_clean.describe()

       Total Assets  Total Deposits
count  3.952000e+03    3.952000e+03
mean   1.366805e+06    7.816821e+05
std    3.130496e+07    1.652510e+07
min    1.400000e+01    0.000000e+00
25%    1.791875e+04    1.685550e+04
50%    5.544050e+04    5.404050e+04
75%    1.967265e+05    1.827685e+05
max    1.471631e+09    9.546776e+08

## 5. Exporting Data

In [41]:
#Export df with missing values
df_wrangled.to_csv(os.path.join(path, 'Datasets', 'Prepared Data', 'DS8_BankSuite_Failures_1934-2023.csv'))

In [42]:
#export df with any rows with missing values removed
df_wrangled_clean.to_csv(os.path.join(path, 'Datasets', 'Prepared Data', 'DS8_BankSuite_Failures_1934-2023_clean.csv'))

In [43]:
#export df with Estimated Loss column removed
df_clean.to_csv(os.path.join(path, 'Datasets', 'Prepared Data', 'DS8_BankSuite_Failures_1934-2023_EL_removed.csv'))

### NOTE: The dataframe being used will be the df_wrangled_clean, where all rows with missing values have been removed.  As there is no way to retrieve the missing data for those values and using the mean/median values will not make sense for many of those institutions, it's been decided that removing those from the dataset would be best in order to maintain consistency for the values that we do have.

### The other exported dataframes will be kept on file should it be prudent to go back and use that information for purposes in the future.